[
  {
    "id": 1,
    "title": "Clean the World Program Sponsored by Straightaway Health",
    "location": "Clean the World",
    "trackID": [ 1 ],
    "description": "Straightaway Health Careers is proud to sponsor a Clean the World event at Impact Nation this year. Help us reach our goal of assembling 500 hygiene kits to send to the Aid of Victims of Domestic Abuse of Orlando during Monday morning’s registration time (9:30-11:30am).",
    "startTime": 1506936600,
    "endTime": 1506943800,
    "CE": false,
    "speakers":
    [
      {
        "id": 2,
        "firstName": "Mike",
        "lastName": "Mutka",
        "suffix": "",
        "title": "Chief Strategy and Corporate Development Officer, Relias",
        "imageAddress": "https://www.reliaslearning.com/hs-fs/hubfs/reliaslearning-April2016/Images/mike-mutka-2.jpg",
        "description": "Mike Mutka is the Chief Strategy and Corporate Development Officer at Relias Learning. Previously he was the Executive Vice President of Sales and Marketing. Prior to this position, he was President of Silverchair Learning Systems, LLC, which is now part of Relias Learning. Mike also served as the company’s Executive Vice President of Sales and Marketing from 2005-2009. During that time, he built the sales and marketing organization from just two people to a team of 20+ professionals with an impressive track record of growth. Prior to Silverchair Learning, Mike worked for the Hill-Rom Company, Berchtold Corporation, and Briggs Healthcare, all leaders in their markets, and gained extensive experience in new product development, sales and marketing management, strategic planning, and Kaizen continuous improvement methodology. He earned a Bachelor’s degree in Business and an MBA in Marketing from Indiana University‘s Kelley School of Business."
      }
    ]
  },
  {
    "id": 2,
    "title": "Where is Healthcare Headed?",
    "location": "Magnolia - B,C",
    "trackID": [
      1,
      2
    ],
    "description": "Translational Neuroscientist, Carol Clayton, will discuss an overview of today’s current changes and shifts healthcare organizations are experiencing in healthcare. Where are we headed? How dohealthcare analytics and value-based performance management solutions play a significant role for healthcare organizations today? How can you stay on top of these changes?",
    "startTime": 1506949200,
    "endTime": 1506952800,
    "CE": false,
    "speakers":
    [
      {
        "id": 3,
        "firstName": "Carol",
        "lastName": "Clayton",
        "suffix": "",
        "title": "Translational Neuroscience Strategist, Relias",
        "imageAddress": "https://www.reliaslearning.com/hs-fs/hubfs/Resource_Images/Webinars/Presenters/carol-clayton.jpg",
        "description": "Dr. Clayton is a licensed, practicing psychologist with 30 years of healthcare experience in the public and private sector, including non-profit and private practice work. She currently works as the Translational Neuroscientist for Relias, a NC Based Company specializing in online workforce development and training. Before joining Relias, Dr. Clayton served as the CEO of Care Management Technologies, a health IT data analytics company recently acquired by Relias. Prior to her tenure as CEO of CMT, Dr. Clayton served as the Executive Director for the North Carolina Council of Community MH/DD/SA Programs, a nonprofit corporation representing public MH/DD/SA service organizations. She began her career as a psychologist at a local NC state psychiatric facility followed by leading regional public community health child and family services under a capitated Medicaid waiver in NC. Dr. Clayton also served as the Executive Director for Magellan Health Services for the South Atlantic states of North Carolina, South Carolina, Tennessee and Georgia. She has broad public and private sector management and leadership experience."
      }
    ]
  },
  {
    "id": 3,
    "title": "Using CMT Analytics to Outreach & Impact Opioid Prescribers",
    "location": "Magnolia - B,C",
    "trackID": [
      1,
      2
    ],
    "description": "The opioid epidemic ravaging the US has significant roots in the increase of narcotic pain medications and the national shift toward viewing pain as “the fifth vital sign”.",
    "startTime": 1506958200,
    "endTime": 1506961800,
    "CE": false,
    "speakers":
    [
      {
        "id": 4,
        "firstName": "Barbara",
        "lastName": "Hallisey",
        "suffix": "",
        "title": "",
        "imageAddress": "https://www.reliaslearning.com/hs-fs/hubfs/Impact_Nation/Speakers/Barbara-Hallisey.jpg",
        "description": ""
      }
    ]
  },
  {
    "id": 4,
    "title": "Welcome Reception",
    "location": "Upper Pool Deck",
    "trackID": [ 1 ],
    "description": "Join us for the opening welcome reception for Impact Nation 2017.",
    "startTime": 1506967200,
    "endTime": 1506974400,
    "CE": false,
    "speakers":
    [
    ]
  },
  {
    "id": 5,
    "title": "Think Forward. Give Back – What Inspired Our Access for All, Haiti Initiative",
    "location": "Grand Cypress Ballroom - D,E,F",
    "trackID": [ 3 ],
    "description": "Laurent Lamothe will discuss the efforts of the Louis G. Lamothe Foundation to provide support and education to the people of Haiti as the 2010 earthquake recovery efforts transition from emergency relief to sustainable development of infrastructure, including access to health care.  We hope that you are inspired by our partnership with our nearest neighbor to assist in their efforts to recover from natural disaster and loss of infrastructure, and take that co-operative spirit back with you to apply to your corner of the world.",
    "startTime": 1507029000,
    "endTime": 1507030800,
    "CE": false,
    "speakers":
    [
      {
        "id": 5,
        "firstName": "Laurent S.",
        "lastName": "Lamothe",
        "suffix": "",
        "title": "Former Prime Minister, Republic of Haiti",
        "imageAddress": "https://www.reliaslearning.com/hs-fs/hubfs/Impact_Nation/Speakers/Laurent-Lamothe.jpg",
        "description": "Laurent S. Lamothe successfully served as Prime Minister of Haiti from May 2012 to December 2014, the longest tenure of any Prime Minister in the last three decades. During his time in office, Lamothe presided over the design and implementation of an important social policy agenda targeting the poorest sectors of the Haitian population. He also presided over the largest infrastructure development in recent memory."
      }
    ]
  },
  {
    "id": 6,
    "title": "Conflict Resolution",
    "location": "Grand Cypress Ballroom - G,H",
    "trackID": [
      3,
      4
    ],
    "description": "This session will enable the learner to demonstrate integrity in dealing with conflict, particularly in the workplace. This session will ask learners to examine their own reaction to conflict and its effectiveness. The session will arm the learner with ways to handle conflict in a respectful and honest manner and they will know best practices in methods to take action when conflict arises to find a mutually beneficial resolution.  The learner will also be able to lead others in positive ways to find solutions to challenges and problems.",
    "startTime": 1507037400,
    "endTime": 1507040400,
    "CE": true,
    "speakers":
    [
      {
        "id": 6,
        "firstName": "Greg",
        "lastName": "Streuly",
        "suffix": "",
        "title": "Training and Development Specialist, Bethesda Lutheran Communities",
        "imageAddress": "https://www.reliaslearning.com/hs-fs/hubfs/Impact_Nation/Speakers/Greg-Struely.jpg",
        "description": "Greg He holds a Masters degree in Education from the University of Wisconsin - La Crosse as well as a Bachelors degree in Special Education from University of Wisconsin - Whitewater. He is a member of the American Association of Educators and the Wisconsin State Reading Association."
      }
    ]
  },
  {
    "id": 7,
    "title": "Modern Day Customer Service: The Relias Way",
    "location": "Palm - A,B,C",
    "trackID": [
      3,
      6
    ],
    "description": "A step by step guide to putting data and science into the age old art of customer service. In this session we will review the steps to add process around your program, how Relias focuses on customer service, and the best way to implement change.",
    "startTime": 1507046400,
    "endTime": 1507049400,
    "CE": false,
    "speakers":
    [
      {
        "id": 7,
        "firstName": "Candace",
        "lastName": "Wallace",
        "suffix": "",
        "title": "Director of Professional Services, Relias",
        "imageAddress": "https://www.reliaslearning.com/hs-fs/hubfs/Resource_Images/Webinars/Presenters/Candace-Wallace.jpg",
        "description": "Candace joined Relias Learning in 2013. While at Relias, Candace has held the positions of Support Consultant, Client Success Manager, Support Manager, and now Director of Support. Candace is responsible for all areas of client support at Relias Learning and is supported by an amazing team of Support Consultants, Client Success Managers, Solutions Consultants, and Managers. Previously, Candace worked as Laboratory Director for Archaeological Research at Atkins. Candace holds Bachelor’s degrees in both Archaeology and Religion from Baylor University."
      },
      {
        "id": 8,
        "firstName": "Bryon",
        "lastName": "Coro",
        "suffix": "",
        "title": "Director of Accounts Management, Relias Learning",
        "imageAddress": "https://www.reliaslearning.com/hs-fs/hubfs/Impact_Nation/Speakers/Bryon-Coro.jpg",
        "description": ""
      }
    ]
  },
  {
    "id": 8,
    "title": "Achieve Staff Competence in a Whole Person Team-Based Integrated Care Setting",
    "location": "Grand Cypress Ballroom - I",
    "trackID": [
      3,
      5
    ],
    "description": "After over 40 years of providing behavioral health services, Wheeler Clinic began its road to integrated care about five years ago. The creative use of Relias’s training and tracking modules have played a vital role in preparing behavioral health, medical and administrative staff to work in team-based integrated care environments. Wheeler Clinic has strived to build common language and knowledge bases as the agency has built three federally qualified health centers providing whole person team-based integrated care to thousands of clients.",
    "startTime": 1507050000,
    "endTime": 1507053000,
    "CE": true,
    "speakers":
    [
      {
        "id": 9,
        "firstName": "Laura S.",
        "lastName": "Minor",
        "suffix": ", MS, PA",
        "title": "",
        "imageAddress": "https://www.reliaslearning.com/hs-fs/hubfs/Impact_Nation/Speakers/Laura-Minor.jpg",
        "description": "Ms. Minor has been working for 25 years at Wheeler Clinic in many roles including leading community-based prevention programs, training in diverse adult and youth settings and most recently as Staff Development Manager. Ms. Minor also is an adjunct faculty member at the University of Connecticut Master’s in Public Health program. Prior experience includes directing a large citywide HIV/AIDS program, overseeing all aspects of a women’s clinic and providing direct client care in both an inner city clinic and a hospital. Ms. Minor earned her Bachelor’s degree in Biology at the University of Connecticut, her Physician Assistant professional certificate from the United States Public Health Services Hospital in Staten Island, NY and her Master’s in Health Services from California College for Health Sciences."
      },
      {
        "id": 10,
        "firstName": "Heidi A.",
        "lastName": "Joseph",
        "suffix": ", MSN",
        "title": "",
        "imageAddress": "https://www.reliaslearning.com/hs-fs/hubfs/Impact_Nation/Speakers/Heidi-Joseph.jpg",
        "description": "Ms. Joseph has worked in healthcare settings for 20 years, including hospital based acute care and community health centers in the role of staff nurse, infection prevention and control, staff development and training, as well as executive leadership.  Heidi is a Connecticut native and earned her Bachelors of Nursing from University of Saint Joseph, Masters in Nurse from University of Hartford and is currently pursuing a Doctorate of Nursing Practice in Leadership at Quinnipiac University.  She currently oversees daily operations of the integrated Health and Wellness Centers at Wheeler Clinic."
      }
    ]
  },
  {
    "id": 9,
    "title": "Keynote: One More Thing, One More Time",
    "location": "Grand Cypress Ballroom - D,E,F",
    "trackID": [ 7 ],
    "description": "Josh Sundquist is a Paralympic ski racer and bestselling author who has been featured on CNN and in USA TODAY and has spoken across the country to groups ranging from Fortune 500 companies to inner city public schools to the White House. His high-octane blend of energy and humor inspires organizations and individuals to adopt his ski racing motto, 1MT1MT (one more thing, one more time) as their new standard of excellence. Josh shares stories about losing his leg to cancer, ski racing in the Paralympics, and playing jokes with his artificial leg to give motivation for overcoming adversity and reaching peak performance.",
    "startTime": 1507110600,
    "endTime": 1507113600,
    "CE": false,
    "speakers":
    [
      {
        "id": 11,
        "firstName": "Josh",
        "lastName": "Sundquist",
        "suffix": "",
        "title": "Author and Paralympian",
        "imageAddress": "https://www.reliaslearning.com/hs-fs/hubfs/Impact_Nation/Speakers/josh-sundquist-square.jpg",
        "description": "Josh a bestselling author, motivational speaker, and Paralympic ski racer. He has spoken across the world to groups ranging from Fortune 500 companies to inner city public schools to the White House. At age nine, Josh was diagnosed with a rare form of bone cancer and given a fifty percent chance to live. He spent a year on chemotherapy treatments and his left leg was amputated. Doctors declared Josh cured of the disease at age thirteen and he took up ski racing three years later. He trained for the next six years and in 2006 he was named to the US Paralympic Ski Team for the 2006 Paralympics in Turino, Italy."
      }
    ]
  },
  {
    "id": 10,
    "title": "The Journey to the Top: How St Lukes Ascended from Good-to-Great, becoming One of the US’s Very Best Health Systems",
    "location": "Palm - D,E,F",
    "trackID": [ 7 ],
    "description": "Bob Lokken, CEO of WhiteCloud analytics, will focus on the analytic technologies that allow us to harness the power of the data we have only just begun collecting. This technology ranges from automating manually performed tasks, all the way to advanced machine learning algorithms with the power to scan billions of records to uncover patterns and insights today's leaders use to make informed decisions.",
    "startTime": 1507122000,
    "endTime": 1507125000,
    "CE": false,
    "speakers":
    [
      {
        "id": 12,
        "firstName": "Bob",
        "lastName": "Lokken",
        "suffix": "",
        "title": "CEO, WhiteCloud Analytics",
        "imageAddress": "https://www.reliaslearning.com/hs-fs/hubfs/Impact_Nation/Speakers/Bob-Lakken.jpg",
        "description": "Bob Lokken serves as the VP of Analytics for Relias Learning. Lokken recently joined the Relias team from WhiteCloud Analytics, where he was founder and CEO. Also, Lokken serves on the System Board of Trustees for St. Luke’s Health System, and serves as Chairman of the Board of Directors of Idaho Business for Education, a business advocacy organization of 185 CEO’s across the state."
      },
      {
        "id": 13,
        "firstName": "Mark",
        "lastName": "Chasin",
        "suffix": "",
        "title": "CIO, St. Luke's Health System",
        "imageAddress": "https://www.reliaslearning.com/hs-fs/hubfs/Impact_Nation/Speakers/Marc-Chasin.jpg",
        "description": ""
      }
    ]
  },
  {
    "id": 11,
    "title": "Turnover and Retention Workshop",
    "location": "Palm - A,B,C",
    "trackID": [ 8 ],
    "description": "Jan Wilson, M. Ed. SPHR, SHRM-SPC, Director, Learning Design and Outcomes with Relias Learning will lead an interactive 3 hour afternoon workshop to share her in-depth knowledge on staff turnover and retention challenges and solutions. People rave about Jan's techniques for better training programs and techniques to attract, hire and retain the best staff.",
    "startTime": 1506949200,
    "endTime": 1506963600,
    "CE": true,
    "speakers":
    [
      {
        "id": 52,
        "firstName": "Jan",
        "lastName": "Wilson",
        "suffix": "",
        "title": "Director of Learning Designs and Outcomes, Relias",
        "imageAddress": "https://www.reliaslearning.com/hubfs/Impact_Nation/Speakers/Jan-Wlson.jpg",
        "description": "Jan brings over 25 years of technology, human resources and learning expertise to the Relias Learning team. Her experience in senior care spans more than a decade, including serving as a senior executive of learning strategy with one of the country's largest providers. As an organizational development consultant, she has provided strategic planning, process alignment, curriculum development and planning and learning solutions to a variety of clients in pharma, healthcare, and state governments."
      }
    ]
  },
  {
    "id": 12,
    "title": "Course Writing-eLearning Master Class",
    "location": "Regency - 1,2",
    "trackID": [ 8 ],
    "description": "Bring your own laptop! We recommend you have Microsoft Word and Powerpoint. You’ll receive a USB drive with all the materials you need to complete a simulated project as we go through the day.",
    "startTime": 1506949200,
    "endTime": 1506963600,
    "CE": false,
    "speakers":
    [
      {
        "id": 70,
        "firstName": "Maria",
        "lastName": "Samot",
        "suffix": "",
        "title": "Director of Curriculum Research &amp; Design, Relias",
        "imageAddress": "https://www.reliaslearning.com/hubfs/Resource_Images/Webinars/Presenters/Maria-samot.jpg",
        "description": "As Instructional Design Manager for Relias Learning, Maria Samot enjoys leading a team of talented learning experience designers and SMEs as part of the overall Content team. Prior to joining Relias in 2013, Maria was an Associate Project Director at Georgia State University in the College of Education, where she designed and presented training and education in instructor-led, blended learning and elearning formats. She’s also been director of a statewide non-profit educational foundation, as well as an elementary school teacher at an international magnet school in Raleigh, NC. Maria holds a BA in Psychology from NC State University, and an M.Ed. in Divergent Learning from Columbia College."
      },
      {
        "id": 31,
        "firstName": "Dana",
        "lastName": "Thomas",
        "suffix": "",
        "title": "VP of Content Development, Relias",
        "imageAddress": "https://www.reliaslearning.com/hubfs/reliaslearning-April2016/Images/Dana-Thomas.jpg",
        "description": "Dana Thomas is the VP of Content Development at Relias Learning. He leads a team of 40+ individuals working with hundreds of Subject Matter Experts to develop the Relias eLearning libraries. He joined Relias in 2009 and brought with him over a decade of instructor led and asynchronous training experience. He is passionate about efficient training and will literally talk your ear off about it, if you let him."
      }
    ]
  },
  {
    "id": 13,
    "title": "Level I Fundamental RLMS Training",
    "location": "Grand Cypress Ballroom - A,B",
    "trackID": [ 8 ],
    "description": "Workshop for basic users who could be using the system better, beginners or admins that are new users of the RLMS. Covers: User Management, Hierarchy, Modules and Enrollment, Dashboard and Site Settings, Curricula Creation, Advanced Enrollment, and Reporting.",
    "startTime": 1506949200,
    "endTime": 1506963600,
    "CE": false,
    "speakers":
    [
      {
        "id": 101,
        "firstName": "Sue",
        "lastName": "Williams",
        "suffix": " M.Ed.",
        "title": "Client Success Manager, Relias",
        "imageAddress": "https://www.reliaslearning.com/hubfs/Impact_Nation/Speakers/Sue-Williams.jpg",
        "description": ""
      },
      {
        "id": 108,
        "firstName": "Katie",
        "lastName": "Curtis",
        "suffix": "",
        "title": "Client Success Manager, Relias Learning",
        "imageAddress": "https://www.reliaslearning.com/hs-fs/hubfs/Impact_Nation/Speakers/Katie_Curtis.jpg",
        "description": ""
      }
    ]
  },
  {
    "id": 14,
    "title": "Level II Advanced RLMS Training",
    "location": "Grand Cypress Ballroom - G,H",
    "trackID": [ 8 ],
    "description": "Workshop for more seasoned clients who know the basics, but want to dig deeper and learn to use the more robust features. Covers: Module Assembler, Live Events, Requirements Tracker, Skills Checklist, Curricula Building and Advanced Enrollment, and Reporting.",
    "startTime": 1506949200,
    "endTime": 1506963600,
    "CE": false,
    "speakers":
    [
      {
        "id": 94,
        "firstName": "Sara",
        "lastName": "DeFilipps",
        "suffix": "",
        "title": "Client Success Manager, Relias",
        "imageAddress": "https://www.reliaslearning.com/hubfs/Impact_Nation/Speakers/Sara_DeFilipps.jpg",
        "description": ""
      },
      {
        "id": 109,
        "firstName": "Christine",
        "lastName": "Connell",
        "suffix": "",
        "title": "Client Success Manager, Relias Learning",
        "imageAddress": "https://www.reliaslearning.com/hs-fs/hubfs/Impact_Nation/Speakers/Christine-Connell.jpg",
        "description": ""
      }
    ]
  },
  {
  "id": 15,
  "title": "Payer Provider Collaboration: The Value of Data Sharing for Whole Person Care",
  "location": "Magnolia - B,C",
  "trackID": [ 2 ],
  "description": "The relationship between payer and providers is shifting. Payers are establishing greater expectations of providers for integrated care, including care coordination and care management activities that have typically been the functional responsibility of the payer. Provider reimbursement is being tied to performance metrics such as overall health outcomes, functional life skills improvement and quality of care. These shift are fraught with challenges and risks. Collaboration and trust between payer and provider are key.",
  "startTime": 1506953700,
  "endTime": 1506957300,
  "CE": false,
  "speakers":
  [
    {
      "id": 74,
      "firstName": "Megan",
      "lastName": "Johnson",
      "suffix": "",
      "title": "",
      "imageAddress": "https://www.reliaslearning.com/hubfs/Impact_Nation/Speakers/Megan-Johnson.jpg",
      "description": ""
    }
  ]
  },
  {
    "id": 16,
    "title": "Interactive Discussion: Biggest Successes, Failures, and Learnings in 2017",
    "location": "Magnolia - B,C",
    "trackID": [ 2 ],
    "description": "Let’s learn from each other. Join us as we have an interactive discussion around current happenings in each of our states, sharing current projects, successes, and gaps. What tools are you using to succeed? What would you like to see in new developing technologies that address population health management and value-based care models?",
    "startTime": 1506962700,
    "endTime": 1506965400,
    "CE": false,
    "speakers":
    [
      {
        "id": 64,
        "firstName": "Laurie",
        "lastName": "Nelson",
        "suffix": "",
        "title": "Group Product Manager for Analytics, Relias Learning",
        "imageAddress": "https://www.reliaslearning.com/hubfs/Resource_Images/Webinars/Presenters/Laurie-Nelson.jpg",
        "description": "As the Group Product Manager for Analytics, Laurie Nelson is charged with leading the effort to add Healthcare Analytics into Relias Learning’s suite of products, which also includes learning and assessments. She joined Relias in September 2016 and is excited to be working with an incredible team of people to make Analytics a key component of Relias’ overall solution suite which will enable Healthcare organizations to reduce costs, improve care and identify areas for key workforce development. Laurie has 20+ years of software experience in multiple industries, but has spent the last 14 years focused on Analytics, Data Warehousing, and Reporting for both government agencies and technology companies such as Peoplefluent and Teradata. Laurie is particularly passionate about working with software development organizations to build products that give software users the right information at the right time in the right format to enable them to do their jobs with greater success."
      }
    ]
  }
]
