[
  {
    "id": 1,
    "title": "Clean the World Program Sponsored by Straightaway Health",
    "subtitle": "",
    "description": "Straightaway Health Careers is proud to sponsor a Clean the World event at Impact Nation this year. Help us reach our goal of assembling 500 hygiene kits to send to the Aid of Victims of Domestic Abuse of Orlando during Monday morning’s registration time (9:30-11:30am).",
    "startTime": 1506936600,
    "endTime": 1506943800,
    "CE": false,
    "speakers":
    [

    ]
  },
  {
    "id": 2,
    "title": "Where is Healthcare Headed?",
    "subtitle": "CMT User Group",
    "description": "Translational Neuroscientist, Carol Clayton, will discuss an overview of today’s current changes and shifts healthcare organizations are experiencing in healthcare. Where are we headed? How dohealthcare analytics and value-based performance management solutions play a significant role for healthcare organizations today? How can you stay on top of these changes?",
    "startTime": 1506949200,
    "endTime": 1506952800,
    "CE": false,
    "speakers":
    [

    ]
  },
  {
    "id": 3,
    "title": "Using CMT Analytics to Outreach & Impact Opioid Prescribers",
    "subtitle": "CMT User Group",
    "description": "The opioid epidemic ravaging the US has significant roots in the increase of narcotic pain medications and the national shift toward viewing pain as “the fifth vital sign”.",
    "startTime": 1506958200,
    "endTime": 1506961800,
    "CE": false,
    "speakers":
    [

    ]
  },
  {
    "id": 4,
    "title": "Welcome Reception",
    "subtitle": "",
    "description": "Join us for the opening welcome reception for Impact Nation 2017.",
    "startTime": 1506967200,
    "endTime": 1506974400,
    "CE": false,
    "speakers":
    [

    ]
  },
  {
    "id": 5,
    "title": "Think Forward. Give Back – What Inspired Our Access for All, Haiti Initiative",
    "subtitle": "",
    "description": "Laurent Lamothe will discuss the efforts of the Louis G. Lamothe Foundation to provide support and education to the people of Haiti as the 2010 earthquake recovery efforts transition from emergency relief to sustainable development of infrastructure, including access to health care.  We hope that you are inspired by our partnership with our nearest neighbor to assist in their efforts to recover from natural disaster and loss of infrastructure, and take that co-operative spirit back with you to apply to your corner of the world.",
    "startTime": 1507029000,
    "endTime": 1507030800,
    "CE": false,
    "speakers":
    [

    ]
  },
  {
    "id": 6,
    "title": "Conflict Resolution",
    "subtitle": "CE Track 1",
    "description": "This session will enable the learner to demonstrate integrity in dealing with conflict, particularly in the workplace. This session will ask learners to examine their own reaction to conflict and its effectiveness. The session will arm the learner with ways to handle conflict in a respectful and honest manner and they will know best practices in methods to take action when conflict arises to find a mutually beneficial resolution.  The learner will also be able to lead others in positive ways to find solutions to challenges and problems.",
    "startTime": 1507037400,
    "endTime": 1507040400,
    "CE": true,
    "speakers":
    [

    ]
  },
  {
    "id": 7,
    "title": "Modern Day Customer Service: The Relias Way",
    "subtitle": "Thinking Forward",
    "description": "A step by step guide to putting data and science into the age old art of customer service. In this session we will review the steps to add process around your program, how Relias focuses on customer service, and the best way to implement change.",
    "startTime": 1507046400,
    "endTime": 1507049400,
    "CE": false,
    "speakers":
    [

    ]
  },
  {
    "id": 8,
    "title": "Achieve Staff Competence in a Whole Person Team-Based Integrated Care Setting",
    "subtitle": "CE Track 2",
    "description": "After over 40 years of providing behavioral health services, Wheeler Clinic began its road to integrated care about five years ago. The creative use of Relias’s training and tracking modules have played a vital role in preparing behavioral health, medical and administrative staff to work in team-based integrated care environments. Wheeler Clinic has strived to build common language and knowledge bases as the agency has built three federally qualified health centers providing whole person team-based integrated care to thousands of clients.",
    "startTime": 1507050000,
    "endTime": 1507053000,
    "CE": true,
    "speakers":
    [

    ]
  },
  {
    "id": 9,
    "title": "Keynote: One More Thing, One More Time",
    "subtitle": "",
    "description": "Josh Sundquist is a Paralympic ski racer and bestselling author who has been featured on CNN and in USA TODAY and has spoken across the country to groups ranging from Fortune 500 companies to inner city public schools to the White House. His high-octane blend of energy and humor inspires organizations and individuals to adopt his ski racing motto, 1MT1MT (one more thing, one more time) as their new standard of excellence. Josh shares stories about losing his leg to cancer, ski racing in the Paralympics, and playing jokes with his artificial leg to give motivation for overcoming adversity and reaching peak performance.",
    "startTime": 1507110600,
    "endTime": 1507113600,
    "CE": false,
    "speakers":
    [

    ]
  },
  {
    "id": 10,
    "title": "The Journey to the Top: How St Lukes Ascended from Good-to-Great, becoming One of the US’s Very Best Health Systems",
    "subtitle": "Acute Care",
    "description": "Bob Lokken, CEO of WhiteCloud analytics, will focus on the analytic technologies that allow us to harness the power of the data we have only just begun collecting. This technology ranges from automating manually performed tasks, all the way to advanced machine learning algorithms with the power to scan billions of records to uncover patterns and insights today's leaders use to make informed decisions.",
    "startTime": 1507122000,
    "endTime": 1507125000,
    "CE": false,
    "speakers":
    [

    ]
  }
]
